In [16]:
import pandas as pd

In [17]:
 dict1={
     "category":['france','spain','germany','spain','germany','france','france','spain','germany'],
     "age":[44,27,30,38,56,45,37,50,42],
     "salary":[100,200,300,40,.500,600,700,800,900],
     "purchased":['no','yes','no','no','yes','no','no','yes','yes']
 }

In [18]:
df=pd.DataFrame(dict1)

In [19]:
df

  category  age  salary purchased
0   france   44   100.0        no
1    spain   27   200.0       yes
2  germany   30   300.0        no
3    spain   38    40.0        no
4  germany   56     0.5       yes
5   france   45   600.0        no
6   france   37   700.0        no
7    spain   50   800.0       yes
8  germany   42   900.0       yes

In [20]:
##to export darta frame in csv

In [21]:
df.to_csv('salary.csv')

In [22]:
##to remove index from csv idex is called row and column is called column

In [23]:
df.to_csv('salary_indexFalse.csv',index=False)

In [24]:
##if the data frame is too large we can use tail function to display data on user demand

In [25]:
df.tail(2)

  category  age  salary purchased
7    spain   50   800.0       yes
8  germany   42   900.0       yes

In [26]:
df.head(2)

  category  age  salary purchased
0   france   44   100.0        no
1    spain   27   200.0       yes

In [27]:
##describe work on numerical value

In [28]:
df.describe()

            age      salary
count   9.00000    9.000000
mean   41.00000  404.500000
std     9.17878  348.033404
min    27.00000    0.500000
25%    37.00000  100.000000
50%    42.00000  300.000000
75%    45.00000  700.000000
max    56.00000  900.000000

In [29]:
##to read dataframe

In [30]:
df = pd.read_csv('salaryr.csv')

In [31]:
df

  train no\tspeed\tcity
0      12324\t11\tbihar
1      12325\t23\tpatna
2      12326\t24\tdelhi
3     12327\t25\tmumbai
4    12328\t12\tlucknow
5      12319\t23\trachi

In [ ]:
df['city']